/**
 * 这个类是封装的一些常量 
*/

/*----------------------------------------后台Api地址----------------------------------------*/
export const APP_SERVE_URL = 'http://192.168.0.19:8080/'; //测试
/*----------------------------------------文件服务器地址----------------------------------------*/
export const FILE_SERVE_URL = 'http://192.168.0.19:8080/file/'; // 文件服务:测试环境

/*----------------------------------------app版本升级服务地址,查询app最新版本号,更新日志.----------------------------------------*/
export const IS_DEBUG = true; // 是否开发(调试)模式

export const PAGE_SIZE = 5; // 默认分页大小
export const IMAGE_SIZE = 1024; // 拍照/从相册选择照片压缩大小
export const QUALITY_SIZE = 94; // 图像压缩质量，范围为0 - 100
export const REQUEST_TIMEOUT = 20000; // 请求超时时间,单位为毫秒


